<?php
/********************************************************************************************
 * memcache缓存配置
 * @copyright   Copyright(c) 2015
 * @author      iProg
 * @version     1.0
 ********************************************************************************************/

/*------------------------------------------------------------------------------------------
| 参数说明 
| 1.server             memcache服务器地址端口配置，weight为优先级
| 2.expiration         过期时间
| 3.prefix             键值前缀
| 4.compression        使用MEMCACHE_COMPRESSED标记对数据进行压缩(使用zlib)。
| 5.isAutoTresh        是否开启大值自动压缩
| 6.threshold          控制多大值进行自动压缩的阈值
| 7.thresavings        指定经过压缩实际存储的值的压缩率，支持的值必须在0和1之间。
|                      默认值是0.2表示20%压缩率。
-------------------------------------------------------------------------------------------*/

return [
    'server' => [
        ['host' => '127.0.0.1', 'port' => '11211', 'weight' => 1],
        ['host' => '127.0.0.1', 'port' => '11211', 'weight' => 1]
    ],
    'expiration'    =>  18600, 
    'prefix'        =>  'zxw_', 
    'compression'   =>  false,
    'isAutoTresh'   =>  true,
    'threshold'     =>  20000, 
    'thresavings'   =>  0.2 
];

